app/controllers/citas_controller.rb

    def index
        @citas = Cita.search(params[:search],params[:page])
---
SELECT * FROM "citas" ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "citas"

    def show
        @cita = Cita.find(params[:id])
        quien = User.find_by_id(@cita.user_id)
---
SELECT * FROM "citas" WHERE ("citas"."id" = 512)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

    def edit
        @cita = Cita.find(params[:id])
---
SELECT * FROM "citas" WHERE ("citas"."id" = 513)

    def create
        @cita = Cita.new(params[:cita])
        @cita.tag_list = params[:tags]
        respond_to do |format|
            if @cita.save
---
INSERT INTO "citas" ("created_at", "author", "updated_at", "text", "user_id") VALUES('2008-12-28 12:56:43', 'Pat Riley (Entrenador de baloncesto de la NBA)', '2008-12-28 12:56:43', 'Cuando una organización de éxito resulta infectada por la enfermedad del yo, las personas que generan el 20 por ciento de los resultados, empiezan a creer que merecen el ochenta por ciento de las recompensas.', 1)

    def update
        @cita = Cita.find(params[:id])
        @cita.tag_list = params[:tags]
        respond_to do |format|
            if @cita.update_attributes(params[:cita])
---
SELECT * FROM "citas" WHERE ("citas"."id" = 513)
UPDATE "citas" SET "updated_at" = '2008-12-28 19:28:53', "author" = 'Leido en la revista de Vueling - creo que era un entrevista con el director del ars futura' WHERE "id" = 513